ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M2354/PeripheralPins.c
const PinMap PinMap_SPI_SSEL[] = {
    {PA_3, SPI_4, SYS_GPA_MFPL_PA3MFP_QSPI0_SS},
    {NU_PINNAME_BIND(PA_3, SPI_4), SPI_4, SYS_GPA_MFPL_PA3MFP_QSPI0_SS},
    {PA_3, SPI_0, SYS_GPA_MFPL_PA3MFP_SPI0_SS},
    {NU_PINNAME_BIND(PA_3, SPI_0), SPI_0, SYS_GPA_MFPL_PA3MFP_SPI0_SS},
    {PA_6, SPI_1, SYS_GPA_MFPL_PA6MFP_SPI1_SS},
    {PA_11, SPI_2, SYS_GPA_MFPH_PA11MFP_SPI2_SS},
    {PA_12, SPI_2, SYS_GPA_MFPH_PA12MFP_SPI2_SS},
    {PB_2, SPI_1, SYS_GPB_MFPL_PB2MFP_SPI1_SS},
    {PB_10, SPI_3, SYS_GPB_MFPH_PB10MFP_SPI3_SS},
    {PB_15, SPI_0, SYS_GPB_MFPH_PB15MFP_SPI0_SS},
    {PC_0, SPI_1, SYS_GPC_MFPL_PC0MFP_SPI1_SS},
    {PC_3, SPI_4, SYS_GPC_MFPL_PC3MFP_QSPI0_SS},
    {PC_9, SPI_3, SYS_GPC_MFPH_PC9MFP_SPI3_SS},
    {PD_3, SPI_0, SYS_GPD_MFPL_PD3MFP_SPI0_SS},
    {PD_4, SPI_1, SYS_GPD_MFPL_PD4MFP_SPI1_SS},
    {PE_5, SPI_3, SYS_GPE_MFPL_PE5MFP_SPI3_SS},
    {PE_11, SPI_2, SYS_GPE_MFPH_PE11MFP_SPI2_SS},
    {PF_9, SPI_0, SYS_GPF_MFPH_PF9MFP_SPI0_SS},
    {PG_2, SPI_2, SYS_GPG_MFPL_PG2MFP_SPI2_SS},
    {PH_7, SPI_1, SYS_GPH_MFPL_PH7MFP_SPI1_SS},
    {PH_9, SPI_4, SYS_GPH_MFPH_PH9MFP_QSPI0_SS},
    {NU_PINNAME_BIND(PH_9, SPI_4), SPI_4, SYS_GPH_MFPH_PH9MFP_QSPI0_SS},
    {PH_9, SPI_1, SYS_GPH_MFPH_PH9MFP_SPI1_SS},
    {NU_PINNAME_BIND(PH_9, SPI_1), SPI_1, SYS_GPH_MFPH_PH9MFP_SPI1_SS},

    {NC,    NC,    0}
};

//*** SD ***

const PinMap PinMap_SD_DAT0[] = {
    {PB_2, SD_0, SYS_GPB_MFPL_PB2MFP_SD0_DAT0},
    {PE_2, SD_0, SYS_GPE_MFPL_PE2MFP_SD0_DAT0},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_DAT1[] = {
    {PB_3, SD_0, SYS_GPB_MFPL_PB3MFP_SD0_DAT1},
    {PE_3, SD_0, SYS_GPE_MFPL_PE3MFP_SD0_DAT1},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_DAT2[] = {
    {PB_4, SD_0, SYS_GPB_MFPL_PB4MFP_SD0_DAT2},
    {PE_4, SD_0, SYS_GPE_MFPL_PE4MFP_SD0_DAT2},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_DAT3[] = {
    {PB_5, SD_0, SYS_GPB_MFPL_PB5MFP_SD0_DAT3},
    {PE_5, SD_0, SYS_GPE_MFPL_PE5MFP_SD0_DAT3},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_CMD[] = {
    {PB_0, SD_0, SYS_GPB_MFPL_PB0MFP_SD0_CMD},
    {PE_7, SD_0, SYS_GPE_MFPL_PE7MFP_SD0_CMD},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_CLK[] = {
    {PB_1, SD_0, SYS_GPB_MFPL_PB1MFP_SD0_CLK},
    {PE_6, SD_0, SYS_GPE_MFPL_PE6MFP_SD0_CLK},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_CD[] = {
    {PB_12, SD_0, SYS_GPB_MFPH_PB12MFP_SD0_nCD},

    {NC,    NC,    0}
};

const PinMap PinMap_CAN_TD[] = {
    {PA_5, CAN_0, SYS_GPA_MFPL_PA5MFP_CAN0_TXD},
    {PA_12, CAN_0, SYS_GPA_MFPH_PA12MFP_CAN0_TXD},
    {PB_11, CAN_0, SYS_GPB_MFPH_PB11MFP_CAN0_TXD},
    {PC_5, CAN_0, SYS_GPC_MFPL_PC5MFP_CAN0_TXD},
    {PD_11, CAN_0, SYS_GPD_MFPH_PD11MFP_CAN0_TXD},
    {PE_14, CAN_0, SYS_GPE_MFPH_PE14MFP_CAN0_TXD},

    {NC,    NC,     0}
};

const PinMap PinMap_CAN_RD[] = { 
    {PA_4, CAN_0, SYS_GPA_MFPL_PA4MFP_CAN0_RXD},
    {PA_13, CAN_0, SYS_GPA_MFPH_PA13MFP_CAN0_RXD},
    {PB_10, CAN_0, SYS_GPB_MFPH_PB10MFP_CAN0_RXD},
    {PC_4, CAN_0, SYS_GPC_MFPL_PC4MFP_CAN0_RXD},
    {PD_10, CAN_0, SYS_GPD_MFPH_PD10MFP_CAN0_RXD},
    {PE_15, CAN_0, SYS_GPE_MFPH_PE15MFP_CAN0_RXD},

    {NC,    NC,    0}
};
